# Working with Pandas

## What is Pandas?
- Pandas is a powerful Python library used for data analysis and manipulation. 
- It provides easy-to-use data structures and functions to work with structured data, like tables in Excel or CSV files.

#### What is "Data Manipulation"?
Data manipulation means transforming or processing data to make it easier to analyze or use. This includes:

- Cleaning messy data (e.g., removing missing values)

- Filtering specific rows or columns

- Aggregating (e.g., summing or averaging values)

- Merging datasets

- Changing formats

- Sorting data

### Installing and Importing of Libraries

In [11]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\user\anaconda3\lib\site-packages (2.2.2)
Requirement already satisfied: numpy>=1.26.0 in c:\users\user\anaconda3\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\user\anaconda3\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\user\anaconda3\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\user\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in c:\users\user\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [15]:
import pandas as pd
import numpy as np

### Pandas Series

- The series is the object of the Pandas library designed to represent one-dimensional data structures, similar to an array but with some additional features.
- Think of it as a single column or row in a table.

#### Creating of series

In [20]:
#creating of series form python list

s = pd.Series(['a','b','c','d','e'])

In [22]:
s

0    a
1    b
2    c
3    d
4    e
dtype: object

In [31]:
s[0]

'a'

In [24]:
#creating of series from dictionary

p = pd.Series({"name": 'Chizoba', 'age':35, 'marital_status': 'Single'})

In [35]:
p

name              Chizoba
age                    35
marital_status     Single
dtype: object

In [67]:
# creating of series from numpy array

q = pd.Series(np.random.random(5), index=[x for x in 'abcde'])
q

a    0.560678
b    0.066627
c    0.506940
d    0.138194
e    0.754278
dtype: float64

In [28]:
q = pd.Series(np.random.random(5), index=['a','b','c','d','e'])

In [30]:
q

a    0.114637
b    0.957822
c    0.882508
d    0.586894
e    0.697043
dtype: float64

#### Accessing and Modifying elements in a Series

In [63]:
#Creating series from range

ser  = pd.Series([0.1,0.2,0.3,0.4,0.5])
ser

0    0.1
1    0.2
2    0.3
3    0.4
4    0.5
dtype: float64

In [59]:
print(type(ser))

<class 'pandas.core.series.Series'>

#### Formula for iloc - index and location
Variable_name.iloc[row_index, column_index]

In [137]:
#Creating series from range

ser  = pd.Series([0.1,0.2,0.3,0.4,0.5], index=[0,1,2,4,3])
ser

0    0.1
1    0.2
2    0.3
4    0.4
3    0.5
dtype: float64

In [139]:
ser.iloc[3]

0.4

In [143]:
ser.loc[3]

0.5

In [173]:
ser1 = pd.Series(np.random.random(5), index=[x for x in 'abcde'])
ser1

a    0.981161
b    0.026589
c    0.257286
d    0.011549
e    0.121452
dtype: float64

In [177]:
ser1.iloc[2], ser1['b']

(0.257286103217357, 0.026588608777073253)

In [217]:
ser3 = pd.Series(np.random.random(5), index = [0,1,10,3,4])
ser3

0     0.622749
1     0.086566
10    0.359500
3     0.745029
4     0.075332
dtype: float64

In [221]:
ser3.loc[10]

0.3594998757516956

In [157]:
ser2= pd.Series(np.random.random(5))
ser2

0    0.935709
1    0.675974
2    0.779879
3    0.576198
4    0.515449
dtype: float64

In [151]:
print(ser1['b'])

0.28410572542617696

In [155]:
ser1.iloc[2]

0.7666423595880185

In [117]:
#Index and Location  - iloc

ser.iloc[3]

0.4

In [57]:
ser.iloc[0]

1

In [83]:
#Location - loc

ser.loc[2]

0.3

In [125]:
ser1_reset

0    0.1
1    0.2
2    0.3
3    0.4
4    0.5
dtype: float64

#### Operations and Mathematical Function in Pandas

In [182]:
my_dict = {'red':100, 'blue':400, 'white':600}
my_dict1 = pd.Series(my_dict)
my_dict1

red      100
blue     400
white    600
dtype: int64

In [186]:
my_dict2 = {'red':500, 'blue':700, 'white':800}
my_dict2 = pd.Series(my_dict2)
my_dict2

red      500
blue     700
white    800
dtype: int64

In [190]:
my_dict3 = my_dict1+my_dict2

In [192]:
my_dict3

red       600
blue     1100
white    1400
dtype: int64

In [196]:
my_dict3.iloc[2]

1400

In [227]:
my_dict3.loc['white']

1400

In [229]:
print(my_dict3/2)

red      300.0
blue     550.0
white    700.0
dtype: float64

### Pandas DataFrame

Think of a Pandas DataFrame ðŸ¤” as...

- A tabular data structure similar to a spreadsheet
- Extends Series to multiple dimensions
- Acts like a dictionary of Series
- Indexing in DataFrame
    - Row index (labels for each row)
    - Column index (labels for each column)

In [98]:
#keys and Values in dictionary

data.keys()

dict_keys(['Name', 'Quantity', 'Fruits', 'Price'])

In [129]:
import pandas as pd

data = {'Name':['Naomi', 'Israel', 'Vera', 'Friday'],'Quantity':[10,15,5,30],'Fruits':['Orange', 'Mango', 'Pineapple', 'Lemon'], 'Price':[1000,2000,3000,4000], }

df = pd.DataFrame(data, index=['a', 'b', 'c', 'd'])
df

     Name  Quantity     Fruits  Price
a   Naomi        10     Orange   1000
b  Israel        15      Mango   2000
c    Vera         5  Pineapple   3000
d  Friday        30      Lemon   4000

### Selecting, Assigning and Filtering

In [96]:
#Checking of columns

df.columns

Index(['Name', 'Quantity', 'Fruits', 'Price'], dtype='object')

In [100]:
#Index of data

df.index

RangeIndex(start=0, stop=4, step=1)

In [118]:
#Accessing of column

df[['Quantity','Price']]

   Quantity  Price
0        10   1000
1        15   2000
2         5   3000
3        30   4000

In [133]:
df

     Name  Quantity     Fruits  Price
a   Naomi        10     Orange   1000
b  Israel        15      Mango   2000
c    Vera         5  Pineapple   3000
d  Friday        30      Lemon   4000

In [131]:
df.iloc[2]

Name             Vera
Quantity            5
Fruits      Pineapple
Price            3000
Name: c, dtype: object

In [137]:
df.loc['c']

Name             Vera
Quantity            5
Fruits      Pineapple
Price            3000
Name: c, dtype: object

### Assigning

In [210]:
df

     Name     Fruits  Price  Score  Colour
a   Naomi     Orange   1000     40  Yellow
b  Israel      Mango   2000     50  Orange
c    Vera  Pineapple   3000     60   Green
d  Friday      Lemon   4000     70   Green

In [224]:
df['new'] = [40, 50,60,70]

In [226]:
df

     Name     Fruits  Price  Score  Colour  new
a   Naomi     Orange   1000     40  Yellow   40
b  Israel      Mango   2000     50  Orange   50
c    Vera  Pineapple   3000     60   Green   60
d  Friday      Lemon   4000     70   Green   70

In [228]:
del df['new']

In [230]:
df

     Name     Fruits  Price  Score  Colour
a   Naomi     Orange   1000     40  Yellow
b  Israel      Mango   2000     50  Orange
c    Vera  Pineapple   3000     60   Green
d  Friday      Lemon   4000     70   Green

In [216]:
df['Colour'] = ['Yellow', 'Orange', 'Green', 'Green']

In [218]:
df

     Name     Fruits  Price  Score  Colour
a   Naomi     Orange   1000     40  Yellow
b  Israel      Mango   2000     50  Orange
c    Vera  Pineapple   3000     60   Green
d  Friday      Lemon   4000     70   Green

In [170]:
del df['Quantity']

In [172]:
df

     Name     Fruits  Price
a   Naomi     Orange   1000
b  Israel      Mango   2000
c    Vera  Pineapple   3000
d  Friday      Lemon   4000

In [194]:
del df['Colour']

In [196]:
del df['Score']

### Filtering

In [154]:
df[df['Name']=='Israel']

     Name  Quantity Fruits  Price  Score  Colour
b  Israel        15  Mango   2000     50  Orange

In [234]:
df[df['Fruits']=='Mango']

     Name Fruits  Price  Score  Colour
b  Israel  Mango   2000     50  Orange

### Reading and Writing of Data in Pandas

- Data can be read in the following formats:

- csv
- excel
- json
- txt
- html
- sql
- hdf5

In [129]:
import pandas as pd

In [131]:
df = pd.read_csv('airlines_flights_data.csv')
df

,index,airline,flight,source_city,departure_time,stops,arrival_time,destination_city,class,duration,days_left,price
0,0,SpiceJet,SG-8709,Delhi,Evening,zero,Night,Mumbai,Economy,2.17,1,5953
1,1,SpiceJet,SG-8157,Delhi,Early_Morning,zero,Morning,Mumbai,Economy,2.33,1,5953
2,2,AirAsia,I5-764,Delhi,Early_Morning,zero,Early_Morning,Mumbai,Economy,2.17,1,5956
3,3,Vistara,UK-995,Delhi,Morning,zero,Afternoon,Mumbai,Economy,2.25,1,5955
4,4,Vistara,UK-963,Delhi,Morning,zero,Morning,Mumbai,Economy,2.33,1,5955
...,...,...,...,...,...,...,...,...,...,...,...,...
300148,300148,Vistara,UK-822,Chennai,Morning,one,Evening,Hyderabad,Business,10.08,49,69265
300149,300149,Vistara,UK-826,Chennai,Afternoon,one,Night,Hyderabad,Business,10.42,49,77105
300150,300150,Vistara,UK-832,Chennai,Early_Morning,one,Night,Hyderabad,Business,13.83,49,79099
300151,300151,Vistara,UK-828,Chennai,Early_Morning,one,Evening,Hyderabad,Business,10.00,49,81585
300152,300152,Vistara,UK-822,Chennai,Morning,one,Evening,Hyderabad,Business,10.08,49,81585

In [40]:
df1 = pd.read_excel("Finance Dataset.xlsx",sheet_name='FinData')
df1

,Type,Component,2021-01-01,2021-02-01,2021-03-01,2021-04-01,2021-05-01,2021-06-01,2021-07-01,2021-08-01,...,2023-05-01,2023-06-01,2023-07-01,2023-08-01,2023-09-01,2023-10-01,2023-11-01,2023-12-01,2024-01-01,2024-02-01
0,Income,Salary,60000.00,60000.00,60000.00,60000.00,60000.00,60000.00,60000.00,60000.00,...,75000.0,75000.0,75000.0,75000.0,75000.0,75000.0,75600.0,75600.0,75600.0,75600.0
1,Income,Freelancig,1000.00,1000.00,2000.00,3000.00,3000.00,2000.00,2000.00,1000.00,...,4000.0,4000.0,7000.0,7000.0,7000.0,6000.0,6000.0,6000.0,6000.0,6000.0
2,Savings,Mutual funds,6000.00,6000.00,6000.00,6000.00,6000.00,6000.00,6000.00,6000.00,...,7000.0,7000.0,7000.0,7000.0,7000.0,7000.0,8000.0,8000.0,8000.0,8000.0
3,Savings,Emergency Fund,2000.00,2000.00,2000.00,2000.00,2000.00,2000.00,2000.00,0.00,...,2000.0,0.0,1000.0,1000.0,1000.0,1000.0,2000.0,1000.0,3000.0,3000.0
4,Savings,Fixed Deposit,2000.00,2000.00,2000.00,2000.00,2000.00,2000.00,2000.00,2000.00,...,0.0,2000.0,0.0,0.0,2000.0,2000.0,2600.0,2600.0,2600.0,2600.0
5,Savings,Liquid Cash,35600.00,34600.00,36600.00,36600.00,37600.00,35600.00,34600.00,34600.00,...,36100.0,39200.0,37200.0,36400.0,36200.0,37200.0,32200.0,31200.0,31200.0,31750.0
6,Expense,House Rent,10000.00,10000.00,10000.00,10000.00,10000.00,10000.00,12000.00,12000.00,...,16000.0,16000.0,16000.0,16000.0,16000.0,16000.0,16000.0,16000.0,16000.0,16000.0
7,Expense,Groceries & Food,6000.00,6000.00,6000.00,6000.00,6000.00,6000.00,6000.00,6000.00,...,8000.0,8000.0,10000.0,10000.0,10000.0,8000.0,10000.0,10000.0,9000.0,9000.0
8,Expense,Health,1000.00,1000.00,1000.00,1000.00,1000.00,1000.00,1000.00,1000.00,...,3000.0,3000.0,3000.0,3000.0,3000.0,3000.0,3000.0,4000.0,3000.0,3000.0
9,Expense,EMIs,2600.00,2600.00,2600.00,2600.00,2600.00,2600.00,2600.00,2600.00,...,10000.0,10000.0,10000.0,10000.0,10000.0,10000.0,12000.0,12000.0,12000.0,12000.0
10,Expense,Leisure,600.00,1600.00,600.00,1600.00,600.00,1600.00,600.00,1600.00,...,1600.0,600.0,1600.0,3000.0,1600.0,1600.0,1600.0,1600.0,1600.0,1600.0
11,Expense,Shopping,1000.00,1000.00,1000.00,1000.00,1000.00,1000.00,1000.00,1000.00,...,2000.0,0.0,3000.0,2000.0,2000.0,2000.0,2000.0,3000.0,3000.0,2000.0
12,Expense,Trevel,200.00,200.00,200.00,200.00,200.00,200.00,200.00,200.00,...,300.0,200.0,200.0,600.0,200.0,200.0,200.0,200.0,200.0,200.0
13,Expense,Other,100.00,300.00,500.00,300.00,100.00,200.00,700.00,200.00,...,200.0,90.0,200.0,600.0,800.0,200.0,200.0,400.0,200.0,450.0
14,Target,Savings,0.25,0.25,0.25,0.25,0.25,0.25,0.25,0.25,...,0.3,0.3,0.3,0.3,0.3,0.3,0.3,0.3,0.3,0.3

### Exploring and Summarizing Data

In [63]:
#Exploring df - Data for airlines_flights
#Exploring df1 - Finance data

#Checking for the first five rows
df.head()

,index,airline,flight,source_city,departure_time,stops,arrival_time,destination_city,class,duration,days_left,price
0,0,SpiceJet,SG-8709,Delhi,Evening,zero,Night,Mumbai,Economy,2.17,1,5953
1,1,SpiceJet,SG-8157,Delhi,Early_Morning,zero,Morning,Mumbai,Economy,2.33,1,5953
2,2,AirAsia,I5-764,Delhi,Early_Morning,zero,Early_Morning,Mumbai,Economy,2.17,1,5956
3,3,Vistara,UK-995,Delhi,Morning,zero,Afternoon,Mumbai,Economy,2.25,1,5955
4,4,Vistara,UK-963,Delhi,Morning,zero,Morning,Mumbai,Economy,2.33,1,5955

In [67]:
#Checking for the last five rows

df.tail()

,index,airline,flight,source_city,departure_time,stops,arrival_time,destination_city,class,duration,days_left,price
300148,300148,Vistara,UK-822,Chennai,Morning,one,Evening,Hyderabad,Business,10.08,49,69265
300149,300149,Vistara,UK-826,Chennai,Afternoon,one,Night,Hyderabad,Business,10.42,49,77105
300150,300150,Vistara,UK-832,Chennai,Early_Morning,one,Night,Hyderabad,Business,13.83,49,79099
300151,300151,Vistara,UK-828,Chennai,Early_Morning,one,Evening,Hyderabad,Business,10.00,49,81585
300152,300152,Vistara,UK-822,Chennai,Morning,one,Evening,Hyderabad,Business,10.08,49,81585

In [85]:
#Checking for the shape of the data

df.shape

(300153, 12)

In [5]:
df.head()

,index,airline,flight,source_city,departure_time,stops,arrival_time,destination_city,class,duration,days_left,price
0,0,SpiceJet,SG-8709,Delhi,Evening,zero,Night,Mumbai,Economy,2.17,1,5953
1,1,SpiceJet,SG-8157,Delhi,Early_Morning,zero,Morning,Mumbai,Economy,2.33,1,5953
2,2,AirAsia,I5-764,Delhi,Early_Morning,zero,Early_Morning,Mumbai,Economy,2.17,1,5956
3,3,Vistara,UK-995,Delhi,Morning,zero,Afternoon,Mumbai,Economy,2.25,1,5955
4,4,Vistara,UK-963,Delhi,Morning,zero,Morning,Mumbai,Economy,2.33,1,5955

In [97]:
#Checking the info of the dataset

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300153 entries, 0 to 300152
Data columns (total 12 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   index             300153 non-null  int64
 1   airline           300153 non-null  object
 2   flight            300153 non-null  object
 3   source_city       300153 non-null  object
 4   departure_time    300153 non-null  object
 5   stops             300153 non-null  object
 6   arrival_time      300153 non-null  object
 7   destination_city  300153 non-null  object
 8   class             300153 non-null  object
 9   duration          300153 non-null  float64
 10  days_left         300153 non-null  int64
 11  price             300153 non-null  int64
dtypes: float64(1), int64(3), object(8)
memory usage: 27.5+ MB

In [99]:
df.describe()

               index       duration      days_left          price
count  300153.000000  300153.000000  300153.000000  300153.000000
mean   150076.000000      12.221021      26.004751   20889.660523
std     86646.852011       7.191997      13.561004   22697.767366
min         0.000000       0.830000       1.000000    1105.000000
25%     75038.000000       6.830000      15.000000    4783.000000
50%    150076.000000      11.250000      26.000000    7425.000000
75%    225114.000000      16.170000      38.000000   42521.000000
max    300152.000000      49.830000      49.000000  123071.000000

### Working with Data

In [23]:
df['days_left'].unique()

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16, 17,
       18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34,
       35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49],
      dtype=int64)

In [41]:
df['days_left'].nunique()

49

In [25]:
df['flight'].unique()

array(['SG-8709', 'SG-8157', 'I5-764', ..., '6E-7127', '6E-7259',
       'AI-433'], dtype=object)

In [43]:
df['flight'].nunique()

1561

In [31]:
df['arrival_time'].unique()

array(['Night', 'Morning', 'Early_Morning', 'Afternoon', 'Evening',
       'Late_Night'], dtype=object)

In [39]:
df['arrival_time'].nunique()

6

In [35]:
df['stops'].unique()

array(['zero', 'one', 'two_or_more'], dtype=object)

In [37]:
df['stops'].nunique()

3

In [50]:
df['stops'].value_counts()

stops
one            250863
zero            36004
two_or_more     13286
Name: count, dtype: int64

In [91]:
df['days_left'].value_counts

<bound method IndexOpsMixin.value_counts of 0          1
1          1
2          1
3          1
4          1
          ..
300148    49
300149    49
300150    49
300151    49
300152    49
Name: days_left, Length: 300153, dtype: int64>

In [84]:
df['days_left'].value_counts()

value = 1927

for i in df['days_left']:
    if i == value:
        print(i)

In [52]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300153 entries, 0 to 300152
Data columns (total 12 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   index             300153 non-null  int64
 1   airline           300153 non-null  object
 2   flight            300153 non-null  object
 3   source_city       300153 non-null  object
 4   departure_time    300153 non-null  object
 5   stops             300153 non-null  object
 6   arrival_time      300153 non-null  object
 7   destination_city  300153 non-null  object
 8   class             300153 non-null  object
 9   duration          300153 non-null  float64
 10  days_left         300153 non-null  int64
 11  price             300153 non-null  int64
dtypes: float64(1), int64(3), object(8)
memory usage: 27.5+ MB

### Sorting and Ordering

In [93]:
df.head()

,index,airline,flight,source_city,departure_time,stops,arrival_time,destination_city,class,duration,days_left,price
0,0,SpiceJet,SG-8709,Delhi,Evening,zero,Night,Mumbai,Economy,2.17,1,5953
1,1,SpiceJet,SG-8157,Delhi,Early_Morning,zero,Morning,Mumbai,Economy,2.33,1,5953
2,2,AirAsia,I5-764,Delhi,Early_Morning,zero,Early_Morning,Mumbai,Economy,2.17,1,5956
3,3,Vistara,UK-995,Delhi,Morning,zero,Afternoon,Mumbai,Economy,2.25,1,5955
4,4,Vistara,UK-963,Delhi,Morning,zero,Morning,Mumbai,Economy,2.33,1,5955

In [101]:
df['duration'].min()

0.83

In [107]:
df.sort_values('index', ascending=True)

df.head()

,index,airline,flight,source_city,departure_time,stops,arrival_time,destination_city,class,duration,days_left,price
0,0,SpiceJet,SG-8709,Delhi,Evening,zero,Night,Mumbai,Economy,2.17,1,5953
1,1,SpiceJet,SG-8157,Delhi,Early_Morning,zero,Morning,Mumbai,Economy,2.33,1,5953
2,2,AirAsia,I5-764,Delhi,Early_Morning,zero,Early_Morning,Mumbai,Economy,2.17,1,5956
3,3,Vistara,UK-995,Delhi,Morning,zero,Afternoon,Mumbai,Economy,2.25,1,5955
4,4,Vistara,UK-963,Delhi,Morning,zero,Morning,Mumbai,Economy,2.33,1,5955

In [111]:
df.days_left.max()

49

In [109]:
df.sort_values(['duration', 'days_left'], ascending = [True, False])

,index,airline,flight,source_city,departure_time,stops,arrival_time,destination_city,class,duration,days_left,price
197712,197712,Indigo,6E-987,Chennai,Early_Morning,zero,Early_Morning,Bangalore,Economy,0.83,49,1443
197713,197713,Indigo,6E-477,Chennai,Early_Morning,zero,Morning,Bangalore,Economy,0.83,49,1443
197724,197724,Indigo,6E-6137,Chennai,Morning,zero,Morning,Bangalore,Economy,0.83,49,1549
197626,197626,Indigo,6E-987,Chennai,Early_Morning,zero,Early_Morning,Bangalore,Economy,0.83,48,1443
197627,197627,Indigo,6E-477,Chennai,Early_Morning,zero,Morning,Bangalore,Economy,0.83,48,1443
...,...,...,...,...,...,...,...,...,...,...,...,...
193926,193926,Vistara,UK-822,Chennai,Morning,one,Morning,Bangalore,Economy,47.08,3,17223
119508,119508,Air_India,AI-610,Bangalore,Evening,one,Evening,Chennai,Economy,47.75,47,7461
261152,261152,Air_India,AI-610,Bangalore,Evening,one,Evening,Chennai,Business,47.75,47,55122
194359,194359,Air_India,AI-672,Chennai,Evening,one,Evening,Bangalore,Economy,49.83,9,17538
193889,193889,Air_India,AI-672,Chennai,Evening,two_or_more,Evening,Bangalore,Economy,49.83,2,23891

In [113]:
df.sort_values('airline', ascending = False)

,index,airline,flight,source_city,departure_time,stops,arrival_time,destination_city,class,duration,days_left,price
300152,300152,Vistara,UK-822,Chennai,Morning,one,Evening,Hyderabad,Business,10.08,49,81585
85236,85236,Vistara,UK-854,Bangalore,Evening,one,Night,Delhi,Economy,4.58,8,10744
85249,85249,Vistara,UK-866,Bangalore,Night,one,Morning,Delhi,Economy,10.42,8,10744
85248,85248,Vistara,UK-858,Bangalore,Early_Morning,one,Evening,Delhi,Economy,10.25,8,10744
85247,85247,Vistara,UK-846,Bangalore,Morning,one,Evening,Delhi,Economy,9.58,8,10744
...,...,...,...,...,...,...,...,...,...,...,...,...
13305,13305,AirAsia,I5-775,Delhi,Afternoon,one,Night,Bangalore,Economy,11.50,18,5220
13306,13306,AirAsia,I5-792,Delhi,Afternoon,one,Late_Night,Bangalore,Economy,11.58,18,5220
13307,13307,AirAsia,I5-792,Delhi,Afternoon,one,Late_Night,Bangalore,Economy,12.00,18,5220
87638,87638,AirAsia,I5-1229,Bangalore,Evening,one,Late_Night,Delhi,Economy,7.08,20,2723
44388,44388,AirAsia,I5-620,Mumbai,Early_Morning,one,Evening,Delhi,Economy,14.58,9,31799

#### String operations

- Conversion of text to both lower and upper case
- Checking if a column contains a particular item

In [117]:
df.head()

,index,airline,flight,source_city,departure_time,stops,arrival_time,destination_city,class,duration,days_left,price
0,0,SpiceJet,SG-8709,Delhi,Evening,zero,Night,Mumbai,Economy,2.17,1,5953
1,1,SpiceJet,SG-8157,Delhi,Early_Morning,zero,Morning,Mumbai,Economy,2.33,1,5953
2,2,AirAsia,I5-764,Delhi,Early_Morning,zero,Early_Morning,Mumbai,Economy,2.17,1,5956
3,3,Vistara,UK-995,Delhi,Morning,zero,Afternoon,Mumbai,Economy,2.25,1,5955
4,4,Vistara,UK-963,Delhi,Morning,zero,Morning,Mumbai,Economy,2.33,1,5955

In [133]:
df['source_city'] = df['source_city'].str.lower()

In [135]:
df.head()

,index,airline,flight,source_city,departure_time,stops,arrival_time,destination_city,class,duration,days_left,price
0,0,SpiceJet,SG-8709,delhi,Evening,zero,Night,Mumbai,Economy,2.17,1,5953
1,1,SpiceJet,SG-8157,delhi,Early_Morning,zero,Morning,Mumbai,Economy,2.33,1,5953
2,2,AirAsia,I5-764,delhi,Early_Morning,zero,Early_Morning,Mumbai,Economy,2.17,1,5956
3,3,Vistara,UK-995,delhi,Morning,zero,Afternoon,Mumbai,Economy,2.25,1,5955
4,4,Vistara,UK-963,delhi,Morning,zero,Morning,Mumbai,Economy,2.33,1,5955

In [168]:
df['arrival_time'] = df['arrival_time'].str.lower()

df.head()

,index,airline,flight,source_city,departure_time,stops,arrival_time,destination_city,class,duration,days_left,price
0,0,SpiceJet,SG-8709,delhi,Evening,zero,night,Mumbai,Economy,2.17,1,5953
1,1,SpiceJet,SG-8157,delhi,Early_Morning,zero,morning,Mumbai,Economy,2.33,1,5953
2,2,AirAsia,I5-764,delhi,Early_Morning,zero,early_morning,Mumbai,Economy,2.17,1,5956
3,3,Vistara,UK-995,delhi,Morning,zero,afternoon,Mumbai,Economy,2.25,1,5955
4,4,Vistara,UK-963,delhi,Morning,zero,morning,Mumbai,Economy,2.33,1,5955

In [195]:
df['destination_city'] = df['destination_city'].str.lower()
df.head()

,index,airline,flight,source_city,departure_time,stops,arrival_time,destination_city,class,duration,days_left,price
0,0,SpiceJet,SG-8709,delhi,Evening,zero,night,mumbai,Economy,2.17,1,5953
1,1,SpiceJet,SG-8157,delhi,Early_Morning,zero,morning,mumbai,Economy,2.33,1,5953
2,2,AirAsia,I5-764,delhi,Early_Morning,zero,early_morning,mumbai,Economy,2.17,1,5956
3,3,Vistara,UK-995,delhi,Morning,zero,afternoon,mumbai,Economy,2.25,1,5955
4,4,Vistara,UK-963,delhi,Morning,zero,morning,mumbai,Economy,2.33,1,5955

In [249]:
#df['duration'].str.contains('2.17', regex=False, na=False).value_counts()

In [217]:
df['departure_time'].unique()

array(['Evening', 'Early_Morning', 'Morning', 'Afternoon', 'Night',
       'Late_Night'], dtype=object)

#### Handling Duplicates

In [271]:
df2 = pd.read_excel("Finance Dataset.xlsx",sheet_name='Sheet1')
df2

   Score  Age
0     10   30
1     20   50
2     30   40
3     40   60
4     40   60
5     40   60

In [273]:
df2.duplicated().value_counts() # check for duplicates

False    4
True     2
Name: count, dtype: int64

In [299]:
df2 = df2.drop_duplicates() #Remove duplicate rows

In [301]:
df2

   Score  Age
0     10   30
1     20   50
2     30   40
3     40   60

#### Handling Missing Values

In [375]:
df3 = pd.read_excel("Finance Dataset.xlsx",sheet_name='Sheet1')
df3

   Score    Age
0   10.0   30.0
1   20.0   50.0
2    NaN   40.0
3   40.0    NaN
4   40.0   60.0
5    NaN   60.0
6   52.0  100.0
7   53.0    NaN
8   44.0  200.0
9    NaN   10.0

In [377]:
df3.isnull().sum()#Checking for missing data

Score    3
Age      2
dtype: int64

In [369]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Score   7 non-null      float64
 1   Age     8 non-null      float64
dtypes: float64(2)
memory usage: 292.0 bytes

In [371]:
df3.notnull().sum() #checking for missin values

Score    7
Age      8
dtype: int64

In [385]:
df3.dropna(inplace = True) #Dropping Missing 
df3

   Score    Age
0   10.0   30.0
1   20.0   50.0
4   40.0   60.0
6   52.0  100.0
8   44.0  200.0

In [373]:
df3.describe()

           Score         Age
count   7.000000    8.000000
mean   37.000000   68.750000
std    16.155494   59.145704
min    10.000000   10.000000
25%    30.000000   37.500000
50%    40.000000   55.000000
75%    48.000000   70.000000
max    53.000000  200.000000

In [363]:
df3

   Score     Age
0   10.0   30.00
1   20.0   50.00
2   37.0   40.00
3   40.0   68.75
4   40.0   60.00
5   37.0   60.00
6   52.0  100.00
7   53.0   68.75
8   44.0  200.00
9   37.0   10.00

In [361]:
df3['Score'] = df3['Score'].fillna(df3['Score'].mean())
df3['Age'] = df3['Age'].fillna(df3['Age'].mean())

### Writing to csv, excel

In [388]:
df.head()

,index,airline,flight,source_city,departure_time,stops,arrival_time,destination_city,class,duration,days_left,price
0,0,SpiceJet,SG-8709,delhi,evening,zero,night,mumbai,Economy,2.17,1,5953
1,1,SpiceJet,SG-8157,delhi,early_morning,zero,morning,mumbai,Economy,2.33,1,5953
2,2,AirAsia,I5-764,delhi,early_morning,zero,early_morning,mumbai,Economy,2.17,1,5956
3,3,Vistara,UK-995,delhi,morning,zero,afternoon,mumbai,Economy,2.25,1,5955
4,4,Vistara,UK-963,delhi,morning,zero,morning,mumbai,Economy,2.33,1,5955

In [390]:
df['class'] = df['class'].str.lower()
df.head()

,index,airline,flight,source_city,departure_time,stops,arrival_time,destination_city,class,duration,days_left,price
0,0,SpiceJet,SG-8709,delhi,evening,zero,night,mumbai,economy,2.17,1,5953
1,1,SpiceJet,SG-8157,delhi,early_morning,zero,morning,mumbai,economy,2.33,1,5953
2,2,AirAsia,I5-764,delhi,early_morning,zero,early_morning,mumbai,economy,2.17,1,5956
3,3,Vistara,UK-995,delhi,morning,zero,afternoon,mumbai,economy,2.25,1,5955
4,4,Vistara,UK-963,delhi,morning,zero,morning,mumbai,economy,2.33,1,5955

In [406]:
df.to_csv('cleaned_finance_data.csv', index=False)

In [408]:
df4 = pd.read_csv('cleaned_finance_data.csv')
df4.head()


#df4.dropna(axis= ['']inplace =True)

,index,airline,flight,source_city,departure_time,stops,arrival_time,destination_city,class,duration,days_left,price
0,0,SpiceJet,SG-8709,delhi,evening,zero,night,mumbai,economy,2.17,1,5953
1,1,SpiceJet,SG-8157,delhi,early_morning,zero,morning,mumbai,economy,2.33,1,5953
2,2,AirAsia,I5-764,delhi,early_morning,zero,early_morning,mumbai,economy,2.17,1,5956
3,3,Vistara,UK-995,delhi,morning,zero,afternoon,mumbai,economy,2.25,1,5955
4,4,Vistara,UK-963,delhi,morning,zero,morning,mumbai,economy,2.33,1,5955

In [404]:
df.to_excel('Output.xlsx', sheet_name='Sheet2')

In [39]:
import pandas as pd

# Example DataFrame
data = {
    'Math': [75, 88, 92],
    'Science': [89, 90, 94],
    'English': [65, 70, 80]
}

df = pd.DataFrame(data)

# Lambda function
f = lambda x: x.max() - x.min()

# Apply function to each column
result = df.apply(f)

print(result)

Math       17
Science     5
English    15
dtype: int64